Revit 2024 API
ColorOptions Methods
The ColorOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetColorOptions
 Returns the current Revit instance's ColorOptions.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ColorOptions Class
Autodesk.Revit.DB Namespace